import com.data.Product;

/**	*************************************************************************************************
 * 	프로그램 제어 및 컨트롤 클래스
 * 	- 프로그램 진입점 Entry Point main() 메서드 존재
 ** *************************************************************************************************/
public class EXAM {

	public static void main(String[] args) {
		
		
		// Math ======================================================================================
		// 합계, 평균 계산
		Math m1 = new Math();
		
		// 객체/인스턴스 메서드 호출
		int total = m1.getSum(10, 30, 40);
		System.out.println("Total : " + total);
		
		float total2 = m1.getSum(10.f, 30.f, 40.f);
		System.out.println("Total : " + total2);
		
		
		
		// Member ======================================================================================
		//회원 정보 생성
		Member mInfo1 = new Member("m1","mm1","마징가",10,"010-2222-1111",'M',"학생","대구");
		Member mInfo2 = new Member("m2","mm2","홍길동",23,"010-7654-8701",'F',"학생","대구");
		Member mInfo3 = new Member();
		Member mInfo4 = new Member("m3","mm3");
		Member mInfo5 = new Member("m5","mm5","베트맨", "010-1234-5545");
	
		// 회원 정보 출력
		mInfo1.showInfo();
		mInfo2.showInfo();
		mInfo3.showInfo();
		mInfo4.showInfo();
		mInfo5.showInfo();
		
		/*
		 * 
		 * ===========================
		   회원이름 : null
		   전화번호 : 010-2222-1111
		   ===========================
		   ===========================
		   회원이름 : null
		   전화번호 : 010-7654-8701
		   ===========================
		   ===========================
		   회원이름 : null
		   전화번호 : unknown
		   ===========================
		   ===========================
		   회원이름 : null
		   전화번호 : null
		   ===========================
		   ===========================
		   회원이름 : 베트맨
		   전화번호 : 010-1234-5545
		   ===========================

		 */
		
		System.out.println(); //---------------------------------------------------------------------------------------
		
		// Book =======================================================================================================
		
		// 도서 인스턴스/객체 생성 
		
		Book b1 = new Book();
		Book b2 = new Book("소년이 온다", "한강");
		Book b3 = new Book("채식주의자","한강",2007);
		
		//출력
		b1.printInfo();
		b2.printInfo();
		b3.printInfo();
		
// 		>출력화면>>
//		-------------------------
//		도서명: unknown
//		저 자	: unknown
//		출간일: 0
//		-------------------------
//		-------------------------
//		도서명: 소년이 온다
//		저 자	: 한강
//		출간일: 0
//		-------------------------
//		-------------------------
//		도서명: 채식주의자
//		저 자	: 한강
//		출간일: 2007
//		-------------------------
		
		
		System.out.println(); //---------------------------------------------------------------------------------------
		
		// Book2 ======================================================================================================
		
		// 도서 인스턴스 속성 변경
		
		b2.year=2014;
		
		b2.printInfo();
		
//		>출력>>
//		-------------------------
//		도서명: 소년이 온다
//		저 자	: 한강
//		출간일: 2014
//		-------------------------
		
		
		// 도서 인스턴스 객체 생성
		Book2 b4 = new Book2();
		Book2 b5 = new Book2("소년이 간다", "한강");
		Book2 b6 = new Book2("채식주의자","한강",2007);
		
		
		// 메서드 
		//출력
		b4.printInfo();
		b6.printInfo();
		
		System.out.println("deafault 접근지정자 속성 : " + b4.author);
		
		System.out.println(); //---------------------------------------------------------------------------------------
		
		//속성 값 변경
		b5.setTitle("소년이 온다");
		b5.printInfo();

		System.out.println(); //---------------------------------------------------------------------------------------
		
		
		// Product ====================================================================================================
		
		// 제품 인스턴스 생성 
		Product p1 = new Product();
		
		// 메서드 호출
		p1.showInfo();
		System.out.println(p1.searchPrice("P001"));
		
		// 접근지정자 default : 다른 패키지에서 접근 X
		//System.out.println(p1.searchCount("P001"));
		
		
		
		
		
		
	}

}
