#-------------------------------------------------------------------------------------
# 형변환 / 타입캐스팅
#   - 자료형을 다른 종류의 자료형으로 변경
#   - 종류
#       *자동/묵시적 형변환 : 컴퓨터가 진행
#       *수동/명시적 형변환 : 개발자가 진행
#-------------------------------------------------------------------------------------'

age=20.7

# float ---> int변환 : 다시 저장하지 않으면 형변환 결과 적용 x

print(age,'--->' ,int(age),type(age)) #20.7 ---> 20 <class 'float'>
age=int(age) # 변환 결과 저장 age=20

print(age,type(age)) #20 <class 'int'> / 데이터 일부 손실


#int ----> float 변환
age=float(age)
print(age,type(age)) # 20.0 <class 'float'>/ 손실된 데이터 복원X

#float ---> str 변환
age = str(age)
print(age,type(age)) # 20.0 <class 'str'>
print()
