#----------------------------------------------------------------------------------------
# 연산자 - 객체비교 연산자
# ** 객체
#   힙 영역에 존재하는 데이터 즉, 저장된 데이터 
#   클래스를 기반으로 저장 됨
#----------------------------------------------------------------------------------------

num1=10
num2=num1

# 2개의 변수가 동일한 객체를 저장하고 있는지 확인하는 연산자 => 객체비교 연산자
print(f'num1 is num2 => {num1 is num2}')
print(f'num1 id : {id(num1)}\nnum2 id : {id(num2)}')
'''
num1 is num2 => True
num1 id : 2834321140304
num2 id : 2834321140304
'''
print()

num2=10.0
print(f'num1 is num2 => {num1 is num2}')
print(f'num1 id : {id(num1)}\nnum2 id : {id(num2)}')
'''
num1 is num2 => False
num1 id : 1476892191312
num2 id : 1476892842160
'''

#비교연산자 : 크기 비교
print(f'{num1} == {num2}:{num1==num2}')
'''
10 == 10.0:True
'''