#--------------------------------------------------------------------------------------
# 문자열 str 데이터 다루기
#--------------------------------------------------------------------------------------
## 여러줄 문자열 ==> ''' ''' 또는 """ """  ----------------------------------------------
msg='''
오늘은

좋은날
기쁜날
'''

print(f'msg=> {msg}')
#--------------------------------------------------------------------------------------
## 인덱싱 : 문자열 안에 문자 한개 한개를 식별하는 방법
##  - 원소/요소 : 문자열 안에 문자 1개
##  - 사용방법 : 변수명[인덱스], 문자열데이터[인덱스]
##  - 인덱스 종류 
##      *왼 >>> 오 : 0, 1, .....   ## 0부터 시작
##      *왼 <<< 오 : ...., -2, -1  ## -1 부터 시작
#--------------------------------------------------------------------------------------
msg="Good Luck!"
#    0123456789
msg2='' #empty 문자열

# 문자열 전체 출력
print(msg)
'''
Good Luck!
'''
print()

# 문자열 내 원소 출력
print(msg[0])
print(msg[4])
print(msg[-1])

'''
G

!
'''
'''
print(msg2[0])

>> IndexError: string index out of range # 인덱스를 벗어남
'''
print()

# 원소/요소의 갯수를 파악해주는 내장함수 len()--------------------------------------------
#   -원소/요소를 가지고 있는 데이터 타입에만 사용 가능
msg="Good"
print(len(msg)) # 4

#제일 마지막 원소/요소만 출력
print(msg[3],msg[len(msg)-1],msg[-1]) # d d d

data="Happy New Year 2025! Good Luck"
#     012345678901234567890123456789
print(f'인덱스 범위는 : 0 ~ {len(data)-1}') # 인덱스 범위는 : 0 ~ 29

print(data[15],data[16],data[17],data[18],data[19],sep="") 
print(data[15:20]) # 슬라이싱

'''
2025!
2025!
'''
print()

#--------------------------------------------------------------------------------------
## 슬라이싱 : 문자열 내에 연속된 요소/원소 추출 방법
##  - 문법 : 변수명[시작:끝+1] 시작인덱스 이상 ~ 끝인덱스 미만
#--------------------------------------------------------------------------------------
msg="Life is too short, You need Python"
#   Life만 출력하기
#   변수명[ :끝인덱스] :처음부터 의미
print(msg[0:4],msg[:4])
print()
'''
Life Life
'''
#   You need Python만 출력하기
#   변수명[시작인덱스: ] : 끝까지 의미
print(msg[19:35],msg[19:])
print()
'''
You need Python You need Python
'''
#   변수명[ : ] : 처음부터 끝까지
print(msg[:])
'''
Life is too short, You need Python
'''
print()

print(msg[msg.find('Y'):])
'''
You need Python
'''

print()

#--------------------------------------------------------------------------------------
## 슬라이싱 : 문자열 내에 규칙/패턴을 가진 요소/원소 추출 방법
##  - 문법 : 변수명[시작:끝+1:간격] 
#--------------------------------------------------------------------------------------

data='123456789'
#     012345678
# 2,4,6,8 만 추출하기
print(data[1],data[3],data[5],data[7])
#인덱스가 2칸씩 증가하는 규칙
print(data[1:8:2])
print(data[1::2])

'''
2 4 6 8
2468
2468
'''
print()

data='ABC1DEF2GHI3JKL4MNO5PQR6STU'
# 문자열에서 숫자 요소만 추출해주세요
print(data[3::4])
'''
123465
'''