/*	*************************************************************************************************
 *  제어문 - 반복문 for문
 *  for(반복시작;반복중단조건;증감)
 *  {
 *  	반복 될 코드;
 *  }
 *	*************************************************************************************************/



public class EX_FOR_01 {

	public static void main(String[] args) {
		// 1 ~ 10까지 화면 출력
		
		//		 (1)	(2)		(4)
		//				(5)조건확인, true면 (3) 코드 실행 후 (4)
		//						  false 면 빠져나옴
		for(int idx=1; idx<11; idx++)
		{
			//(3) 반복코드
			System.out.println(idx);
		}
		
		/*
		 * >출력 결과>>
		 *	1
			2
			3
			4
			5
			6
			7
			8
			9
			10
		 */
		
		int cnt=0;
		for(cnt=100; cnt<111; cnt++)
		{
			System.out.println(cnt);
		}
		/*
		 * >출력 결과>>
			100
			101
			102
			103
			104
			105
			106
			107
			108
			109
			110
		 */
		
		
		
		
		
		
		
		
		
		
		
		
	}

}
